; domain
( DEFINE ( DOMAIN OILSPILL )
( :REQUIREMENTS :EQUALITY :NEGATIVE-PRECONDITIONS :CONDITIONAL-EFFECTS :TYPING :UNIVERSAL-PRECONDITIONS )
( :TYPES
	VEHICLE - AGENT
	TASK - OBJECT
	CAPABILITY - OBJECT
	AGENT - OBJECT
)
( :CONSTANTS
)
( :PREDICATES
	( FREE-BLOCK )
	( SELECTING )
	( APPLYING )
	( RESETTING )
	( FREE-AGENT ?AGENT0 - AGENT )
	( BUSY-AGENT ?AGENT0 - AGENT )
	( DONE-AGENT ?AGENT0 - AGENT )
	( HAS ?VEHICLE0 - VEHICLE ?CAPABILITY1 - CAPABILITY )
	( NEEDS ?TASK0 - TASK ?CAPABILITY1 - CAPABILITY )
	( AT ?VEHICLE0 - VEHICLE ?TASK1 - TASK )
	( BE_DONE_BEFORE ?TASK0 - TASK ?TASK1 - TASK )
	( DONE ?TASK0 - TASK )
	( ACTIVE-DO-TASK ?VEHICLE0 - VEHICLE ?TASK1 - TASK )
	( REQ-NEG-DO-TASK ?VEHICLE0 - VEHICLE ?TASK1 - TASK )
	( ACTIVE-MOVE-TO-TASK ?VEHICLE0 - VEHICLE ?TASK1 - TASK ?TASK2 - TASK )
	( REQ-NEG-MOVE-TO-TASK ?VEHICLE0 - VEHICLE ?TASK1 - TASK ?TASK2 - TASK )
)
( :ACTION START
  :PARAMETERS ( )
  :PRECONDITION
	( AND
		( FREE-BLOCK )
	)
  :EFFECT
	( AND
		( NOT ( FREE-BLOCK ) )
		( SELECTING )
	)
)
( :ACTION APPLY
  :PARAMETERS ( )
  :PRECONDITION
	( AND
		( SELECTING )
	)
  :EFFECT
	( AND
		( NOT ( SELECTING ) )
		( APPLYING )
	)
)
( :ACTION RESET
  :PARAMETERS ( )
  :PRECONDITION
	( AND
		( APPLYING )
	)
  :EFFECT
	( AND
		( NOT ( APPLYING ) )
		( RESETTING )
	)
)
( :ACTION FINISH
  :PARAMETERS ( )
  :PRECONDITION
	( AND
		( RESETTING )
		( FORALL
			( ?AGENT0 - AGENT )
			( FREE-AGENT ?AGENT0 )
		)
	)
  :EFFECT
	( AND
		( NOT ( RESETTING ) )
		( FREE-BLOCK )
	)
)
( :ACTION SELECT-DO-TASK
  :PARAMETERS ( ?VEHICLE0 - VEHICLE ?TASK1 - TASK )
  :PRECONDITION
	( AND
		( SELECTING )
		( FREE-AGENT ?VEHICLE0 )
		( NOT ( REQ-NEG-DO-TASK ?VEHICLE0 ?TASK1 ) )
		( AT ?VEHICLE0 ?TASK1 )
		(FORALL (?cap - CAPABILITY)
                (imply
                    (needs ?TASK1 ?cap)
                    (has ?VEHICLE0 ?cap)
                )
            )
        (FORALL (?othertask - TASK)
            (imply
                (be_done_before ?othertask ?TASK1)
                (done ?othertask)
            )
        )
	)
  :EFFECT
	( AND
		( NOT ( FREE-AGENT ?VEHICLE0 ) )
		( BUSY-AGENT ?VEHICLE0 )
		( ACTIVE-DO-TASK ?VEHICLE0 ?TASK1 )
	)
)
( :ACTION DO-DO-TASK
  :PARAMETERS ( ?VEHICLE0 - VEHICLE ?TASK1 - TASK )
  :PRECONDITION
	( AND
		( APPLYING )
		( BUSY-AGENT ?VEHICLE0 )
		( ACTIVE-DO-TASK ?VEHICLE0 ?TASK1 )
	)
  :EFFECT
	( AND
		( NOT ( BUSY-AGENT ?VEHICLE0 ) )
		( DONE-AGENT ?VEHICLE0 )
		( DONE ?TASK1 )
	)
)
( :ACTION END-DO-TASK
  :PARAMETERS ( ?VEHICLE0 - VEHICLE ?TASK1 - TASK )
  :PRECONDITION
	( AND
		( RESETTING )
		( DONE-AGENT ?VEHICLE0 )
		( ACTIVE-DO-TASK ?VEHICLE0 ?TASK1 )
	)
  :EFFECT
	( AND
		( NOT ( DONE-AGENT ?VEHICLE0 ) )
		( FREE-AGENT ?VEHICLE0 )
		( NOT ( ACTIVE-DO-TASK ?VEHICLE0 ?TASK1 ) )
	)
)
( :ACTION SELECT-MOVE-TO-TASK
  :PARAMETERS ( ?VEHICLE0 - VEHICLE ?TASK1 - TASK ?TASK2 - TASK )
  :PRECONDITION
	( AND
		( SELECTING )
		( FREE-AGENT ?VEHICLE0 )
		( NOT ( REQ-NEG-MOVE-TO-TASK ?VEHICLE0 ?TASK1 ?TASK2 ) )
		( AT ?VEHICLE0 ?TASK1 )
	)
  :EFFECT
	( AND
		( NOT ( FREE-AGENT ?VEHICLE0 ) )
		( BUSY-AGENT ?VEHICLE0 )
		( ACTIVE-MOVE-TO-TASK ?VEHICLE0 ?TASK1 ?TASK2 )
	)
)
( :ACTION DO-MOVE-TO-TASK
  :PARAMETERS ( ?VEHICLE0 - VEHICLE ?TASK1 - TASK ?TASK2 - TASK )
  :PRECONDITION
	( AND
		( APPLYING )
		( BUSY-AGENT ?VEHICLE0 )
		( ACTIVE-MOVE-TO-TASK ?VEHICLE0 ?TASK1 ?TASK2 )
	)
  :EFFECT
	( AND
		( NOT ( BUSY-AGENT ?VEHICLE0 ) )
		( DONE-AGENT ?VEHICLE0 )
		( NOT ( AT ?VEHICLE0 ?TASK1 ) )
		( AT ?VEHICLE0 ?TASK2 )
	)
)
( :ACTION END-MOVE-TO-TASK
  :PARAMETERS ( ?VEHICLE0 - VEHICLE ?TASK1 - TASK ?TASK2 - TASK )
  :PRECONDITION
	( AND
		( RESETTING )
		( DONE-AGENT ?VEHICLE0 )
		( ACTIVE-MOVE-TO-TASK ?VEHICLE0 ?TASK1 ?TASK2 )
	)
  :EFFECT
	( AND
		( NOT ( DONE-AGENT ?VEHICLE0 ) )
		( FREE-AGENT ?VEHICLE0 )
		( NOT ( ACTIVE-MOVE-TO-TASK ?VEHICLE0 ?TASK1 ?TASK2 ) )
	)
)
)

; problem
( DEFINE ( PROBLEM OILSPILL1234 )
( :DOMAIN OILSPILL )
( :OBJECTS
	UAV SUBMERSIBLE BOAT - VEHICLE
	TASK_INIT TASK_MAPAREA TASK_SAMPLE TASK_SAMPLE_2 TASK_CONTAINMENT TASK_CLEANUP - TASK
	VISION SAMPLING FLIGHT DISPERSE CONTAINMENT - CAPABILITY
)
( :INIT
	( FREE-BLOCK )
	( FREE-AGENT UAV )
	( FREE-AGENT SUBMERSIBLE )
	( FREE-AGENT BOAT )
	( HAS UAV FLIGHT )
	( HAS UAV VISION )
	( HAS UAV SAMPLING )
	( HAS BOAT VISION )
	( HAS BOAT SAMPLING )
	( HAS BOAT CONTAINMENT )
	( HAS SUBMERSIBLE DISPERSE )
	( NEEDS TASK_MAPAREA FLIGHT )
	( NEEDS TASK_MAPAREA VISION )
	( NEEDS TASK_SAMPLE SAMPLING )
	( NEEDS TASK_SAMPLE_2 SAMPLING )
	( NEEDS TASK_CONTAINMENT CONTAINMENT )
	( NEEDS TASK_CLEANUP DISPERSE )
	( BE_DONE_BEFORE TASK_MAPAREA TASK_CONTAINMENT )
	( BE_DONE_BEFORE TASK_SAMPLE TASK_CONTAINMENT )
	( BE_DONE_BEFORE TASK_SAMPLE_2 TASK_CONTAINMENT )
	( BE_DONE_BEFORE TASK_CONTAINMENT TASK_CLEANUP )
	( AT UAV TASK_INIT )
	( AT SUBMERSIBLE TASK_INIT )
	( AT BOAT TASK_INIT )
)
( :GOAL
	( AND
		( FREE-BLOCK )
		( DONE TASK_MAPAREA )
		( DONE TASK_SAMPLE )
		( DONE TASK_SAMPLE_2 )
		( DONE TASK_CONTAINMENT )
		( DONE TASK_CLEANUP )
	)
)
)

; plan
1. (start)
   deleted: (free-block)
   added: (selecting)
   goals met: 0 of 6
2. (select-move-to-task uav task_init task_maparea)
   deleted: (free-agent uav)
   added: (busy-agent uav) (active-move-to-task uav task_init task_maparea)
   goals met: 0 of 6
3. (apply)
   deleted: (selecting)
   added: (applying)
   goals met: 0 of 6
4. (do-move-to-task uav task_init task_maparea)
   deleted: (busy-agent uav) (at uav task_init)
   added: (done-agent uav) (at uav task_maparea)
   goals met: 0 of 6
5. (reset)
   deleted: (applying)
   added: (resetting)
   goals met: 0 of 6
6. (end-move-to-task uav task_init task_maparea)
   deleted: (done-agent uav) (active-move-to-task uav task_init task_maparea)
   added: (free-agent uav)
   goals met: 0 of 6
7. (finish)
   deleted: (resetting)
   added: (free-block)
   goals met: 1 of 6
8. (start)
   deleted: (free-block)
   added: (selecting)
   goals met: 0 of 6
9. (select-move-to-task boat task_init task_sample)
   deleted: (free-agent boat)
   added: (busy-agent boat) (active-move-to-task boat task_init task_sample)
   goals met: 0 of 6
10. (apply)
   deleted: (selecting)
   added: (applying)
   goals met: 0 of 6
11. (do-move-to-task boat task_init task_sample)
   deleted: (busy-agent boat) (at boat task_init)
   added: (done-agent boat) (at boat task_sample)
   goals met: 0 of 6
12. (reset)
   deleted: (applying)
   added: (resetting)
   goals met: 0 of 6
13. (end-move-to-task boat task_init task_sample)
   deleted: (done-agent boat) (active-move-to-task boat task_init task_sample)
   added: (free-agent boat)
   goals met: 0 of 6
14. (finish)
   deleted: (resetting)
   added: (free-block)
   goals met: 1 of 6
15. (start)
   deleted: (free-block)
   added: (selecting)
   goals met: 0 of 6
16. (select-do-task boat task_sample)
   deleted: (free-agent boat)
   added: (busy-agent boat) (active-do-task boat task_sample)
   goals met: 0 of 6
17. (apply)
   deleted: (selecting)
   added: (applying)
   goals met: 0 of 6
18. (do-do-task boat task_sample)
   deleted: (busy-agent boat)
   added: (done-agent boat) (done task_sample)
   goals met: 1 of 6
19. (reset)
   deleted: (applying)
   added: (resetting)
   goals met: 1 of 6
20. (end-do-task boat task_sample)
   deleted: (done-agent boat) (active-do-task boat task_sample)
   added: (free-agent boat)
   goals met: 1 of 6
21. (finish)
   deleted: (resetting)
   added: (free-block)
   goals met: 2 of 6
22. (start)
   deleted: (free-block)
   added: (selecting)
   goals met: 1 of 6
23. (select-do-task uav task_maparea)
   deleted: (free-agent uav)
   added: (busy-agent uav) (active-do-task uav task_maparea)
   goals met: 1 of 6
24. (select-move-to-task submersible task_init task_cleanup)
   deleted: (free-agent submersible)
   added: (busy-agent submersible) (active-move-to-task submersible task_init task_cleanup)
   goals met: 1 of 6
25. (select-move-to-task boat task_sample task_sample_2)
   deleted: (free-agent boat)
   added: (busy-agent boat) (active-move-to-task boat task_sample task_sample_2)
   goals met: 1 of 6
26. (apply)
   deleted: (selecting)
   added: (applying)
   goals met: 1 of 6
27. (do-do-task uav task_maparea)
   deleted: (busy-agent uav)
   added: (done-agent uav) (done task_maparea)
   goals met: 2 of 6
28. (do-move-to-task submersible task_init task_cleanup)
   deleted: (busy-agent submersible) (at submersible task_init)
   added: (done-agent submersible) (at submersible task_cleanup)
   goals met: 2 of 6
29. (do-move-to-task boat task_sample task_sample_2)
   deleted: (busy-agent boat) (at boat task_sample)
   added: (done-agent boat) (at boat task_sample_2)
   goals met: 2 of 6
30. (reset)
   deleted: (applying)
   added: (resetting)
   goals met: 2 of 6
31. (end-move-to-task boat task_sample task_sample_2)
   deleted: (done-agent boat) (active-move-to-task boat task_sample task_sample_2)
   added: (free-agent boat)
   goals met: 2 of 6
32. (end-move-to-task submersible task_init task_cleanup)
   deleted: (done-agent submersible) (active-move-to-task submersible task_init task_cleanup)
   added: (free-agent submersible)
   goals met: 2 of 6
33. (end-do-task uav task_maparea)
   deleted: (done-agent uav) (active-do-task uav task_maparea)
   added: (free-agent uav)
   goals met: 2 of 6
34. (finish)
   deleted: (resetting)
   added: (free-block)
   goals met: 3 of 6
35. (start)
   deleted: (free-block)
   added: (selecting)
   goals met: 2 of 6
36. (select-do-task boat task_sample_2)
   deleted: (free-agent boat)
   added: (busy-agent boat) (active-do-task boat task_sample_2)
   goals met: 2 of 6
37. (apply)
   deleted: (selecting)
   added: (applying)
   goals met: 2 of 6
38. (do-do-task boat task_sample_2)
   deleted: (busy-agent boat)
   added: (done-agent boat) (done task_sample_2)
   goals met: 3 of 6
39. (reset)
   deleted: (applying)
   added: (resetting)
   goals met: 3 of 6
40. (end-do-task boat task_sample_2)
   deleted: (done-agent boat) (active-do-task boat task_sample_2)
   added: (free-agent boat)
   goals met: 3 of 6
41. (finish)
   deleted: (resetting)
   added: (free-block)
   goals met: 4 of 6
42. (start)
   deleted: (free-block)
   added: (selecting)
   goals met: 3 of 6
43. (select-move-to-task boat task_sample_2 task_containment)
   deleted: (free-agent boat)
   added: (busy-agent boat) (active-move-to-task boat task_sample_2 task_containment)
   goals met: 3 of 6
44. (apply)
   deleted: (selecting)
   added: (applying)
   goals met: 3 of 6
45. (do-move-to-task boat task_sample_2 task_containment)
   deleted: (busy-agent boat) (at boat task_sample_2)
   added: (done-agent boat) (at boat task_containment)
   goals met: 3 of 6
46. (reset)
   deleted: (applying)
   added: (resetting)
   goals met: 3 of 6
47. (end-move-to-task boat task_sample_2 task_containment)
   deleted: (done-agent boat) (active-move-to-task boat task_sample_2 task_containment)
   added: (free-agent boat)
   goals met: 3 of 6
48. (finish)
   deleted: (resetting)
   added: (free-block)
   goals met: 4 of 6
49. (start)
   deleted: (free-block)
   added: (selecting)
   goals met: 3 of 6
50. (select-do-task boat task_containment)
   deleted: (free-agent boat)
   added: (busy-agent boat) (active-do-task boat task_containment)
   goals met: 3 of 6
51. (apply)
   deleted: (selecting)
   added: (applying)
   goals met: 3 of 6
52. (do-do-task boat task_containment)
   deleted: (busy-agent boat)
   added: (done-agent boat) (done task_containment)
   goals met: 4 of 6
53. (reset)
   deleted: (applying)
   added: (resetting)
   goals met: 4 of 6
54. (end-do-task boat task_containment)
   deleted: (done-agent boat) (active-do-task boat task_containment)
   added: (free-agent boat)
   goals met: 4 of 6
55. (finish)
   deleted: (resetting)
   added: (free-block)
   goals met: 5 of 6
56. (start)
   deleted: (free-block)
   added: (selecting)
   goals met: 4 of 6
57. (select-do-task submersible task_cleanup)
   deleted: (free-agent submersible)
   added: (busy-agent submersible) (active-do-task submersible task_cleanup)
   goals met: 4 of 6
58. (apply)
   deleted: (selecting)
   added: (applying)
   goals met: 4 of 6
59. (do-do-task submersible task_cleanup)
   deleted: (busy-agent submersible)
   added: (done-agent submersible) (done task_cleanup)
   goals met: 5 of 6
60. (reset)
   deleted: (applying)
   added: (resetting)
   goals met: 5 of 6
61. (end-do-task submersible task_cleanup)
   deleted: (done-agent submersible) (active-do-task submersible task_cleanup)
   added: (free-agent submersible)
   goals met: 5 of 6
62. (finish)
   deleted: (resetting)
   added: (free-block)
   goals met: 6 of 6
